# ExternalEvent Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalEvent Methods
ExternalEvent Class See Also
---
The ExternalEvent type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create | Creates an instance of external event. |
| CreateJournalable | Creates an instance of external event which will have the ability to record its executions in the journal. |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Raise | Instructing Revit to raise (signal) the external event. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ExternalEvent Class
Autodesk.Revit.UI Namespace